tutorials/solvers/overInterPlicDyMFoam/twoSquaresOutDomain_overInterDyMFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            (overset fvMotionSolvers);

application     overInterDyMFoam;
startFrom       startTime;
startTime       0.0;
stopAt          endTime;
endTime         0.08;
deltaT          1e-6;

writeControl    adjustable;
writeInterval   0.01;
purgeWrite      0;
writeFormat     binary;
writePrecision  12;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;
maxCo           1.0;
maxAlphaCo      0.5;
maxDeltaT       1;

functions
{
    probes
    {
        type            probes;
        libs            (sampling);
        name            probes;
        writeControl    timeStep;
        writeInterval   1;
        fields          (p U);
        interpolationScheme cell;
        probeLocations
        (
             (0.0009999 0.0015 0.003)
        );
    }

    alphaVol
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        fields          (alpha.water);
        operation       volIntegrate;
        regionType      all;
        postOperation   none;
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        log             true;
    }

    // Added functions
    isoInterface
    {
        type                surfaces;
        libs                (sampling);
        writeControl        adjustableRunTime;
        writeInterval       0.0002;

        surfaceFormat       vtp;
        fields              ( alpha.water U p p_rgh volZoneID cellMask interpolatedCells );

        interpolationScheme cellPoint;

        surfaces
        (
            isoSurf
            {
                type        isoSurfaceTopo;
                isoField    alpha.water;
                isoValue    0.5;
                interpolate true;
            }
        );
    }

    hole
    {
        type                surfaces;
        libs                (sampling);
        writeControl        adjustableRunTime;
        writeInterval       0.0002;

        surfaceFormat       vtp;
        fields              (p U alpha.water);

        interpolationScheme cellPoint;  //<- default

        surfaces
        {
            face1
            {
                type            patch;
                patches         (hole);
                interpolate     false;
                triangulate     false;
            }
        }
    }

    zPlaneCut
    {
        $hole;

        fields              ( alpha.water U p p_rgh volZoneID cellMask interpolatedCells );

        surfaces
        (
            face1
            {
                type            cuttingPlane;
                planeType       pointAndNormal;
                pointAndNormalDict
                {
                    point       (0.01 0.005 0.005);
                    normal      (0 0 1);
                    interpolate false;
                }
            }
        );
    }
}


// ************************************************************************* //
